src/cf/InformationRegisters/НастройкиОповещенийОПисьмах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОповещенийОПисьмах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказыватьВсплывающиеОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьСписокОповещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиОповещенийОПисьмах/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Добавляет запись в регистр по переданным параметрам
//
Процедура Записать(ПараметрыОповещения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	МенеджерЗаписиРегистра = РегистрыСведений.НастройкиОповещенийОПисьмах.СоздатьМенеджерЗаписи();
	МенеджерЗаписиРегистра.УчетнаяЗапись = ПараметрыОповещения.УчетнаяЗапись;
	МенеджерЗаписиРегистра.Пользователь = ПараметрыОповещения.Пользователь;
	МенеджерЗаписиРегистра.ПоказыватьВсплывающиеОповещения = ПараметрыОповещения.ПоказыватьВсплывающиеОповещения;
	МенеджерЗаписиРегистра.ПоказыватьСписокОповещений = ПараметрыОповещения.ПоказыватьСписокОповещений;
	МенеджерЗаписиРегистра.Записать();
	
КонецПроцедуры

#КонецЕсли
